"""These datasets are designed to insert 10 rows into each table"""

FIRST_NAMES = [
    "Иван",
    "Анна",
    "Сергей",
    "Елена",
    "Дмитрий",
    "Ольга",
    "Алексей",
    "Мария",
    "Виктор",
    "Наталья",
]
LAST_NAMES = [
    "Иванов",
    "Петрова",
    "Сидоров",
    "Кузнецова",
    "Смирнов",
    "Орлова",
    "Федоров",
    "Волкова",
    "Морозов",
    "Зайцева",
]
PATRONYMICS = [
    "Сергеевич",
    "Андреевна",
    "Дмитриевич",
    "Николаевна",
    "Владимирович",
    "Павловна",
]

ORGANIZATION_NAMES = [
    "ТехноСфера",
    "Глобал Инжиниринг",
    "Альфа Консалт",
    "Бета Системс",
    "МегаТрон",
    "ИнноваЛаб",
    "Стратегия+",
    "ЭнергоПроект",
    "Диджитал Групп",
    "Форсайт",
]

PROJECT_NAMES = [
    "Разработка CRM",
    "Миграция на облако",
    "Оптимизация процессов",
    "ERP-интеграция",
    "Веб-платформа 2.0",
    "Автоматизация склада",
    "BI-отчетность",
    "Мобильное приложение",
    "Кибербезопасность",
    "AI-аналитика",
]

ACTIVITY_TYPES = [
    "Аналитика",
    "Разработка",
    "Тестирование",
    "Деплой",
    "Совещание",
    "Обучение",
    "Поддержка",
    "Документация",
    "Мониторинг",
    "Ревью кода",
]
